{
  "lastUpdated": 1769835378326,
  "items": [
    {
      "title": "Inside William Ruto's public participation nightmare",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539722/inside-william-ruto-s-public-participation-nightmare",
      "pubDate": "Sat, 31 Jan 2026 07:00:00 +0300",
      "contentSnippet": "Whereas the constitution outlines need for public views to be factored in projects there is no law guiding it",
      "source": "The Standard",
      "category": "Legislation",
      "relevanceScore": 3
    },
    {
      "title": "Opposition demands arrest of officers involved in church attack",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539733/opposition-demands-arrest-of-officers-involved-in-church-attack",
      "pubDate": "Sat, 31 Jan 2026 07:00:00 +0300",
      "contentSnippet": "United Opposition leaders have issued a two-week notice to IG Kanja to arrest, disarm and prosecute police officers involved in Othaya church chaos.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Motsepe convenes urgent EXCO meeting to review CAF regulations",
      "link": "https://www.kbc.co.ke/motsepe-convenes-urgent-exco-meeting-to-review-caf-regulations/",
      "pubDate": "Fri, 30 Jan 2026 20:52:49 +0000",
      "contentSnippet": "The Confederation of African Football President Patrice Motsepe, has convened an executive committee to review its regulations and disciplinary code to ensure judicial bodies have the power to impose appropriate and dissuasive sanctions for serious violations of the CAF statutes. While citing satisfaction with the disciplinary committee rulings on the incidents which halted the African […]\nThe post Motsepe convenes urgent EXCO meeting to review CAF regulations appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Legislation",
      "relevanceScore": 5
    },
    {
      "title": "Kenya steps up fight to eliminate four NTDs by 2030",
      "link": "https://www.kbc.co.ke/kenya-steps-up-fight-to-eliminate-four-ntds-by-2030/",
      "pubDate": "Fri, 30 Jan 2026 20:26:59 +0000",
      "contentSnippet": "Kenya is on track to eliminate lymphatic filariasis, bilharzia (schistosomiasis), onchocerciasis (river blindness) and trachoma. \nThe post Kenya steps up fight to eliminate four NTDs by 2030 appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Committee",
      "relevanceScore": 3
    },
    {
      "title": "Court okays importation of 254,000 tonnes duty-free rice",
      "link": "https://www.kenyanews.go.ke/court-okays-importation-of-254000-tonnes-duty-free-rice/",
      "pubDate": "Fri, 30 Jan 2026 19:10:04 +0000",
      "contentSnippet": "The High Court in Kerugoya has cleared the government to proceed with the importation of 254,000 metric tonnes of duty-free rice in a move aimed at stabilising the country’s rice supply and cushioning consumers from rising prices. In a ruling delivered on Thursday, Justice Edward Muriithi approved the phased importation of rice in three equal...",
      "source": "Kenya News Agency",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "Muoria urges TVET to align programmes with jobs market",
      "link": "https://www.kenyanews.go.ke/muoria-urges-tvet-to-align-programmes-with-jobs-market/",
      "pubDate": "Fri, 30 Jan 2026 19:03:40 +0000",
      "contentSnippet": "The government has urged Technical and Vocational Education and Training (TVET) institutions to ensure their programmes remain aligned with industry needs and emerging labour-market trends, warning that expanding access to education without improving employability will not deliver sustainable economic impact. Speaking during the Nation Media 18th Higher Education Fair and Skills Expo 2026 in Nairobi,...",
      "source": "Kenya News Agency",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Health CS Duale hosts UNICEF to accelerate maternal, newborn, child health initiatives",
      "link": "https://www.kbc.co.ke/health-cs-duale-hosts-unicef-to-accelerate-maternal-newborn-child-health-initiatives/",
      "pubDate": "Fri, 30 Jan 2026 18:50:33 +0000",
      "contentSnippet": "Health Cabinet Secretary Aden Duale has reaffirmed the Ministry’s focus on high-impact interventions, including skilled birth attendance, emergency obstetric and newborn care, neonatal resuscitation. Speaking when he hosted a UNICEF delegation, he highlighted initiatives such as the Maternal and Newborn Health Rapid Results Initiative and Every Woman, Every Newborn Everywhere, which promote quality, respectful care […]\nThe post Health CS Duale hosts UNICEF to accelerate maternal, newborn, child health initiatives appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Committee",
      "relevanceScore": 4
    },
    {
      "title": "Kenya, Uganda hold talks on Pipeline divestment, energy security",
      "link": "https://www.kenyanews.go.ke/kenya-uganda-hold-talks-on-pipeline-divestment-energy-security/",
      "pubDate": "Fri, 30 Jan 2026 18:47:38 +0000",
      "contentSnippet": "Kenya and Uganda have held high-level consultations on Kenya’s ongoing divestment of the Kenya Pipeline Company (KPC) through an Initial Public Offering (IPO), in a move aimed at safeguarding regional energy security and deepening economic cooperation between the two countries. Cabinet Secretary for the National Treasury and Economic Planning, John Mbadi, is in Uganda for...",
      "source": "Kenya News Agency",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Balanced criticism key to better governance, Murkomen tells LSK",
      "link": "https://www.kbc.co.ke/balanced-criticism-key-to-better-governance-murkomen-tells-lsk/",
      "pubDate": "Fri, 30 Jan 2026 18:36:50 +0000",
      "contentSnippet": "Interior CS highlights collaboration between legal fraternity and government as essential for national progress\nThe post Balanced criticism key to better governance, Murkomen tells LSK appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Kenya, US deepen ties on trade, security",
      "link": "https://www.kenyanews.go.ke/kenya-us-deepen-ties-on-trade-security/",
      "pubDate": "Fri, 30 Jan 2026 18:22:25 +0000",
      "contentSnippet": "Kenya and the United States have reaffirmed their commitment to strengthening bilateral cooperation in security, trade, infrastructure development and regional stability. This followed high-level talks held in Nairobi between Prime Cabinet Secretary and Cabinet Secretary for Foreign and Diaspora Affairs, Dr. Musalia Mudavadi, and United States Deputy Secretary of State, Christopher Landau. Speaking during a...",
      "source": "Kenya News Agency",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "DIGI-AI Bus launched to equip public primary school learners with digital, AI skills",
      "link": "https://www.kbc.co.ke/digi-ai-bus-launched-to-equip-public-primary-school-learners-with-digital-ai-skills/",
      "pubDate": "Fri, 30 Jan 2026 18:03:47 +0000",
      "contentSnippet": "The Kings Rugby Development Academy has launched a new mobile digital learning initiative, the DIGI-AI Bus, to bridge the digital divide by providing hands-on access to computers and the internet, as well as basic digital skills, particularly for learners in underserved communities. The DIGI-AI BUS initiative will fast-track learners’ readiness for the global digital economy […]\nThe post DIGI-AI Bus launched to equip public primary school learners with digital, AI skills appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Agra urges global leaders to treat hunger as a systemic global risk ",
      "link": "https://www.kbc.co.ke/agra-urges-global-leaders-to-treat-hunger-as-a-systemic-global-risk/",
      "pubDate": "Fri, 30 Jan 2026 17:51:20 +0000",
      "contentSnippet": "Africa-led institution underscores that climate pressures, geopolitical disruptions, and fragile food systems are increasingly intersecting in ways that elevate the risk of widespread hunger.\nThe post Agra urges global leaders to treat hunger as a systemic global risk  appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Idah Odinga: Raila's wish to be buried within 72 hours caught us by surprise",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539738/idah-odinga-raila-s-wish-to-be-buried-within-72-hours-caught-us-by-surprise",
      "pubDate": "Fri, 30 Jan 2026 20:25:44 +0300",
      "contentSnippet": "The widow of the late Raila Odinga, Mama Idah Odinga, has revealed that his request to be buried within 72 hours of his death caught the family by surprise.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "CS Oparanya champions youth empowerment, cooperatives in Teso North",
      "link": "https://www.kbc.co.ke/cs-oparanya-champions-youth-empowerment-cooperatives-in-teso-north/",
      "pubDate": "Fri, 30 Jan 2026 16:59:11 +0000",
      "contentSnippet": "The Cabinet Secretary for Cooperatives and MSMEs Development, Wycliffe Oparanya, has reaffirmed the Government’s commitment to inclusive, bottom-up development by placing youth empowerment and cooperative strengthening at the centre of Kenya’s economic transformation agenda. Speaking during the Teso North Youth Conference held at Chemasiri Technical and Vocational College, CS Oparanya urged young people to intentionally […]\nThe post CS Oparanya champions youth empowerment, cooperatives in Teso North appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 3
    },
    {
      "title": "Sanitary pads factory launched in Homa Bay,aims to end period poverty",
      "link": "https://www.kbc.co.ke/sanitary-pads-factory-launched-in-homa-bayaims-to-end-period-poverty/",
      "pubDate": "Fri, 30 Jan 2026 16:09:49 +0000",
      "contentSnippet": "In a move aimed at fighting period poverty in Kenya, Galentine Care Ltd has launched an all women led Galentine Care Sanitary Pad Factory in Homa Bay County which will major in the production of sanitary pads while creating employment for women. The plant, which was opened by Homa Bay Governor Gladys Wanga, functions at […]\nThe post Sanitary pads factory launched in Homa Bay,aims to end period poverty appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Legislation",
      "relevanceScore": 3
    },
    {
      "title": "Former CAF disciplinary Chairman Hack slams AFCON final sanctions",
      "link": "https://www.kbc.co.ke/former-caf-disciplinary-chairman-hack-slams-afcon-final-sanctions/",
      "pubDate": "Fri, 30 Jan 2026 15:16:05 +0000",
      "contentSnippet": "Former CAF Disciplinary Committee chairman Raymond Hack has criticised the recent sanctions issued in relation to the chaos which disrupted the AFCON final between Morocco and Senegal, saying that instead Senegal head coach Pape Thiaw should have been handed a stiffer punishment for largely being responsible for what transpired. Speaking in a TV show interview […]\nThe post Former CAF disciplinary Chairman Hack slams AFCON final sanctions appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "President Ruto urges Kenyans to reject tribal politics, backs UDA–ODM Coalition ahead of 2027",
      "link": "https://www.kbc.co.ke/president-ruto-urges-kenyans-to-reject-tribal-politics-backs-uda-odm-coalition-ahead-of-2027/",
      "pubDate": "Fri, 30 Jan 2026 14:59:34 +0000",
      "contentSnippet": "President William Ruto has urged Kenyans to reject leaders propagating the politics of hatred and tribalism. The President said there was more to gain in unity among Kenyans than divisive politics. Speaking in Kondele grounds in Kisumu County, on Friday, the President said political division and tribalism are not helpful in nation building. “The reason […]\nThe post President Ruto urges Kenyans to reject tribal politics, backs UDA–ODM Coalition ahead of 2027 appeared first on KBC Digital.",
      "source": "KBC News",
      "category": "Debate",
      "relevanceScore": 3
    },
    {
      "title": "Winnie Odinga: Bold emergence igniting fierce struggle over ODM's political future",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539697/winnie-odinga-bold-emergence-igniting-fierce-struggle-over-odm-s-political-future",
      "pubDate": "Fri, 30 Jan 2026 10:20:00 +0300",
      "contentSnippet": "Winnie Odingas bold emergence after Railas death has ignited a fierce struggle over legacy, leadership, and ODMs political future.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Inside ODM's fever in UDA",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539677/inside-odm-s-fever-in-uda",
      "pubDate": "Fri, 30 Jan 2026 08:30:00 +0300",
      "contentSnippet": "Leaders allied to UDA are increasingly uneasy that many of them could become casualties of an impending pre-election power-sharing pact President Ruto and ODM leader Oburu Oginga.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Mt Kenya politics marred by claims of police misuse, forced transfers",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539681/mt-kenya-politics-marred-by-claims-of-police-misuse-forced-transfers",
      "pubDate": "Fri, 30 Jan 2026 08:30:00 +0300",
      "contentSnippet": "Claims of misuse and politically driven transfers of police officers have moved to the centre of an escalating power struggle in the Mt Kenya region.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 3
    },
    {
      "title": "Wamalwa leaves Ford-K, sets sights on UDA leadership",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539678/wamalwa-leaves-ford-k-sets-sights-on-uda-leadership",
      "pubDate": "Fri, 30 Jan 2026 08:20:00 +0300",
      "contentSnippet": "Former Kiminini MP Chris Wamalwa has defected from Ford Kenya and declared his intention to contest the UDA Secretary General position, currently held by Hassan Omar.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "United Opposition rubbishes division rumors",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539619/united-opposition-rubbishes-division-rumors",
      "pubDate": "Thu, 29 Jan 2026 12:33:28 +0300",
      "contentSnippet": "United Opposition leaders insist they will hold together and agree on one candidate to run against President William Ruto in 2027.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Winnie: Only the NDC can confirm ODM leadership",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539584/winnie-only-the-ndc-can-confirm-odm-leadership",
      "pubDate": "Thu, 29 Jan 2026 08:30:00 +0300",
      "contentSnippet": "Winnie referred to Oburu as a transitional party leader pointing out that the substantive leadership of the party would be decided by the NDC.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Mbarire put on the spot by the Senate for diverting Sh10 million to fund Boda Boda event",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539593/mbarire-put-on-the-spot-by-the-senate-for-diverting-sh10-million-to-fund-boda-boda-event",
      "pubDate": "Thu, 29 Jan 2026 00:00:00 +0300",
      "contentSnippet": "Embu Governor Cecil Mbarire has been put on the spot by the Senate for diverting Sh10 million meant for development to fund a political gathering meant to empower Bodaboda riders.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "Opposition issues demands to IEBC, threatens mass action if not addressed",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539590/opposition-issues-demands-to-iebc-threatens-mass-action-if-not-addressed",
      "pubDate": "Wed, 28 Jan 2026 20:00:00 +0300",
      "contentSnippet": "Opposition leaders threatened to lead mass action against the commission should it fail to address their concerns for a free, fair and verifiable election.",
      "source": "The Standard",
      "category": "Legislation",
      "relevanceScore": 3
    },
    {
      "title": "Oketch Salah fires back after Winnie Odinga interview",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539573/oketch-salah-fires-back-after-winnie-odinga-interview",
      "pubDate": "Wed, 28 Jan 2026 17:46:00 +0300",
      "contentSnippet": "A charged public debate between Winnie Odinga and businessman Oketch Salah has erupted over claims surrounding the final moments of former Prime Minister Raila Odinga.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Former Governor Kiraitu Murungi retires from active politics",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539554/former-governor-kiraitu-murungi-retires-from-active-politics",
      "pubDate": "Wed, 28 Jan 2026 15:02:15 +0300",
      "contentSnippet": "Murungi was first elected to Parliament in 1992 and went on to serve as a cabinet minister during President Mwai Kibakis administration.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "ODM divisions rekindle memories of bitter ousters of top leaders",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539506/odm-divisions-rekindle-memories-of-bitter-ousters-of-top-leaders",
      "pubDate": "Wed, 28 Jan 2026 08:20:00 +0300",
      "contentSnippet": "Orange party leaders insist the differing opinions are part and parcel of democracy.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Questions over next poll as IEBC postpones boundaries review",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539496/questions-over-next-poll-as-iebc-postpones-boundaries-review",
      "pubDate": "Wed, 28 Jan 2026 08:15:00 +0300",
      "contentSnippet": "The electoral commission may not undertake a full boundary delimitation exercise ahead of the 2027 General Election, it has emerged.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Wetang'ula says 56pc of MPs will not be re-elected",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539499/wetang-ula-says-56pc-of-mps-will-not-be-re-elected",
      "pubDate": "Wed, 28 Jan 2026 06:30:00 +0300",
      "contentSnippet": "Speaker Moses Wetang'ula said the upcoming general election would be tough and tricky, citing the rising political temperatures.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "Senators consider withholding funds from errant governors",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539513/senators-consider-withholding-funds-from-errant-governors",
      "pubDate": "Wed, 28 Jan 2026 06:20:00 +0300",
      "contentSnippet": "Senators are considering a motion to withhold funds from counties whose governors fail to appear before Senate oversight committees to answer audit queries.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 5
    },
    {
      "title": "Winnie Odinga claims intimidation of dissenters within ODM",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539519/winnie-odinga-claims-intimidation-of-dissenters-within-odm",
      "pubDate": "Wed, 28 Jan 2026 06:15:00 +0300",
      "contentSnippet": "Winnie called for the convening of an NDC to guide such coalition decisions.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Vihiga governor grilled over Sh5m for house party",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539492/vihiga-governor-grilled-over-sh5m-for-house-party",
      "pubDate": "Tue, 27 Jan 2026 18:15:26 +0300",
      "contentSnippet": "Vihiga Governor Wilberforce Ottichilo has been put on the spot by the Senate over the accumulation of Sh1.7 billion in pending bills and the use of Sh5 million on a housewarming party.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "Mathira MP Wamumbi responds to allegations in Othaya church attack",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539487/mathira-mp-wamumbi-responds-to-allegations-in-othaya-church-attack",
      "pubDate": "Tue, 27 Jan 2026 17:10:02 +0300",
      "contentSnippet": "Wamumbi urged fellow politicians not to link him to unrest in areas outside his jurisdiction.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 3
    },
    {
      "title": "Nakuru becomes new battleground as UDA moves to counter Gachagua's forays",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539472/nakuru-becomes-new-battleground-as-uda-moves-to-counter-gachagua-s-forays",
      "pubDate": "Tue, 27 Jan 2026 13:08:27 +0300",
      "contentSnippet": "Former Deputy President Rigathi Gachaguas planned tour of Nakuru County has triggered a series of high-level political consultative meetings among UDA politicians.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Why a full boundary review is unlikely before 2027 polls",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539465/why-a-full-boundary-review-is-unlikely-before-2027-polls",
      "pubDate": "Tue, 27 Jan 2026 12:24:47 +0300",
      "contentSnippet": "2027 polls: Boundary delimitation to be phased due to time constraints, full review before general election would strain preparedness, IEBC Chairperson Ethekon says.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "The untouchable: Is power couple's hand in Gachagua's woes?",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539423/the-untouchable-is-power-couple-s-hand-in-gachagua-s-woes",
      "pubDate": "Tue, 27 Jan 2026 08:15:00 +0300",
      "contentSnippet": "The MPs have almost always been mentioned in connection with chaotic incidents at church services and political meetings attended by former Deputy President Rigathi Gachagua.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "How churches have been caught in political crossfire",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539424/how-churches-have-been-caught-in-political-crossfire",
      "pubDate": "Tue, 27 Jan 2026 08:15:00 +0300",
      "contentSnippet": "With barely a year to the next General Election, churches are emerging as soft targets in Kenyas simmering political tensions.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "Watchdog role in question as MPs hold luxury retreat",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539422/watchdog-role-in-question-as-mps-hold-luxury-retreat",
      "pubDate": "Tue, 27 Jan 2026 08:10:00 +0300",
      "contentSnippet": "Members of Parliament have convened this week at a luxury resort in Naivasha for a five-day legislative retreat aimed at securing a parliamentary legacy.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 4
    },
    {
      "title": "Wajir governor defends Sh700m pending bills payments",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539419/wajir-governor-defends-sh700m-pending-bills-payments",
      "pubDate": "Tue, 27 Jan 2026 07:00:00 +0300",
      "contentSnippet": "Wajir Governor Ahmed Abdullahi told the Senate that his administration has made significant progress in settling inherited pending bills, insisting that only verifiable claims are being honoured.",
      "source": "The Standard",
      "category": "Legislation",
      "relevanceScore": 3
    },
    {
      "title": "Malala: Police behind teargas attack on Gachagua in Othaya",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539439/malala-police-behind-teargas-attack-on-gachagua-in-othaya",
      "pubDate": "Mon, 26 Jan 2026 23:06:17 +0300",
      "contentSnippet": "DCP Deputy Party Leader Cleophas Malala alleges police orchestrated the attack on party leader Rigathi Gachagua at Witima Anglican Church of Kenya in Othaya.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    },
    {
      "title": "ODM leaders defend Oburu Oginga choice as divisions simmer",
      "link": "https://www.standardmedia.co.ke/politics/article/2001539431/odm-leaders-defend-oburu-oginga-choice-as-divisions-simmer",
      "pubDate": "Mon, 26 Jan 2026 20:41:07 +0300",
      "contentSnippet": "ODM leadership has rallied behind Oburu Oginga as party leader, even as critics question whether he can steer the party through a fractious period.",
      "source": "The Standard",
      "category": "Debate",
      "relevanceScore": 2
    }
  ]
}